In [1]:
# Dependencies
import pandas as pd
import pymongo

In [2]:
# Store filepath in a variable
emissions = "emissions.csv"

In [3]:
# Read our Data file with the pandas library
# Not every CSV requires an encoding, but be aware this can come up
emissions_df = pd.read_csv(emissions)

In [4]:
# Show just the header
emissions_df.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,CO2 emissions (kt),EN.ATM.CO2E.KT,11092.6750,11576.71900,12713.48900,12178.10700,11840.74300,10623.2990,...,2500.894,1349.456,861.745,872.746,898.415,883.747,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,CO2 emissions (kt),EN.ATM.CO2E.KT,414.3710,491.37800,689.39600,707.73100,839.74300,1008.4250,...,12240.446,10755.311,9050.156,8467.103,9035.488,8672.455,NaN,NaN,NaN,NaN
2,Angola,AGO,CO2 emissions (kt),EN.ATM.CO2E.KT,550.0500,454.70800,1180.77400,1151.43800,1224.77800,1188.1080,...,30586.447,34176.440,33692.396,44851.077,34583.477,34693.487,NaN,NaN,NaN,NaN
3,Albania,ALB,CO2 emissions (kt),EN.ATM.CO2E.KT,2024.1840,2280.87400,2464.22400,2082.85600,2016.85000,2174.5310,...,5240.143,4924.781,4913.780,5489.499,4616.753,4536.079,NaN,NaN,NaN,NaN
4,Arab World,ARB,CO2 emissions (kt),EN.ATM.CO2E.KT,56005.2998,62578.60559,70562.05073,85085.75151,99693.91377,120039.5355,...,1660509.275,1841219.035,1823115.056,1932296.314,1953773.933,1904104.418,NaN,NaN,NaN,NaN

In [5]:
# Delete extraneous column
del emissions_df['2017']
del emissions_df['2018']
del emissions_df['2019']
del emissions_df['2020']

emissions_df.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,Aruba,ABW,CO2 emissions (kt),EN.ATM.CO2E.KT,11092.6750,11576.71900,12713.48900,12178.10700,11840.74300,10623.2990,...,2823.590,2658.575,2629.239,2508.228,2500.894,1349.456,861.745,872.746,898.415,883.747
1,Afghanistan,AFG,CO2 emissions (kt),EN.ATM.CO2E.KT,414.3710,491.37800,689.39600,707.73100,839.74300,1008.4250,...,2273.540,4206.049,6769.282,8463.436,12240.446,10755.311,9050.156,8467.103,9035.488,8672.455
2,Angola,AGO,CO2 emissions (kt),EN.ATM.CO2E.KT,550.0500,454.70800,1180.77400,1151.43800,1224.77800,1188.1080,...,25151.953,25709.337,27792.193,29057.308,30586.447,34176.440,33692.396,44851.077,34583.477,34693.487
3,Albania,ALB,CO2 emissions (kt),EN.ATM.CO2E.KT,2024.1840,2280.87400,2464.22400,2082.85600,2016.85000,2174.5310,...,3927.357,4374.731,4378.398,4598.418,5240.143,4924.781,4913.780,5489.499,4616.753,4536.079
4,Arab World,ARB,CO2 emissions (kt),EN.ATM.CO2E.KT,56005.2998,62578.60559,70562.05073,85085.75151,99693.91377,120039.5355,...,1360284.651,1491783.271,1581643.106,1643369.717,1660509.275,1841219.035,1823115.056,1932296.314,1953773.933,1904104.418

In [6]:
emissions_df = emissions_df.rename(columns={"Country Name":"country", "Country Code":"iso3code", "Indicator Name":"indicator_name", "Indicator Code":"indicator_code"})

emissions_df.head()

,country,iso3code,indicator_name,indicator_code,1960,1961,1962,1963,1964,1965,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,Aruba,ABW,CO2 emissions (kt),EN.ATM.CO2E.KT,11092.6750,11576.71900,12713.48900,12178.10700,11840.74300,10623.2990,...,2823.590,2658.575,2629.239,2508.228,2500.894,1349.456,861.745,872.746,898.415,883.747
1,Afghanistan,AFG,CO2 emissions (kt),EN.ATM.CO2E.KT,414.3710,491.37800,689.39600,707.73100,839.74300,1008.4250,...,2273.540,4206.049,6769.282,8463.436,12240.446,10755.311,9050.156,8467.103,9035.488,8672.455
2,Angola,AGO,CO2 emissions (kt),EN.ATM.CO2E.KT,550.0500,454.70800,1180.77400,1151.43800,1224.77800,1188.1080,...,25151.953,25709.337,27792.193,29057.308,30586.447,34176.440,33692.396,44851.077,34583.477,34693.487
3,Albania,ALB,CO2 emissions (kt),EN.ATM.CO2E.KT,2024.1840,2280.87400,2464.22400,2082.85600,2016.85000,2174.5310,...,3927.357,4374.731,4378.398,4598.418,5240.143,4924.781,4913.780,5489.499,4616.753,4536.079
4,Arab World,ARB,CO2 emissions (kt),EN.ATM.CO2E.KT,56005.2998,62578.60559,70562.05073,85085.75151,99693.91377,120039.5355,...,1360284.651,1491783.271,1581643.106,1643369.717,1660509.275,1841219.035,1823115.056,1932296.314,1953773.933,1904104.418

In [7]:
# Insert into Mongo
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)

# Define the 'electric_vehicles' database in Mongo
db = client.electric_vehicles

# Drop the 'emissions' collection if it exists
db['emissions'].drop()

# Insert Emission data

data = emissions_df.to_dict(orient='records')  # Here's our added param..
db.emissions.insert_many(data)